#pragma once

#ifndef __GAME_H__ // インクルードガード
#define __GAME_H__


//*****************************************************************************
//  Include
//*****************************************************************************
#include "mino.h"
#include "field.h"
#include "board.h"


//*****************************************************************************
//  Class
//*****************************************************************************
class Game
{
private:
    Mino  mino_;  // テトリミノクラス
    Field field_; // フィールドクラス
    Board board_; // 盤面クラス

public:
    Game();        // コンストラクタ
    ~Game();       // デストラクタ

    bool init();    // 初期化
    bool update();  // 更新
    void draw();    // 描画
    void destroy(); // 破棄
};

#endif
