#include "progress.h"


//*****************************************************************************
//  コンストラクタ
//*****************************************************************************
Progress::Progress() : scene_no_( kGame )
{
}


//*****************************************************************************
//  デストラクタ
//*****************************************************************************
Progress::~Progress()
{
    // 念のため現在進行中のシーンを破棄
    switch( scene_no_ )
    {
        case kTitle:
            break;
        case kGame:
            game_.destroy();
            break;
        case kEnding:
            break;
    }
}


//*****************************************************************************
//  初期化
//*****************************************************************************
bool Progress::init()
{

    // 最初に開始するシーン
    scene_no_ = kGame;
    if( !game_.init() ) return false;


    return true;
}


//*****************************************************************************
//  更新
//*****************************************************************************
bool Progress::update()
{
    switch( scene_no_ )
    {
        case kTitle:
            break;
        case kGame:
            game_.update();
            break;
        case kEnding:
            break;
    }

    return true;
}


//*****************************************************************************
//  描画
//*****************************************************************************
void Progress::draw()
{
    switch( scene_no_ )
    {
        case kTitle:
            break;
        case kGame:
            game_.draw();
            break;
        case kEnding:
            break;
    }
}