#pragma once
#ifndef __PROGRESS_H__ // インクルードガード
#define __PROGRESS_H__


//*****************************************************************************
//  Include
//*****************************************************************************
#include "game.h"


//*****************************************************************************
//  Enum
//*****************************************************************************
enum
{
    kTitle, // タイトル画面   
    kGame,  // ゲーム画面
    kEnding // エンディング画面
};


//*****************************************************************************
//  Class
//*****************************************************************************
class Progress
{
private:
    Game game_;    // ゲームクラス
    int scene_no_; // 現在のシーン番号

public:
    Progress();     // コンストラクタ
    ~Progress();    // デストラクタ

    bool init();    // 初期化
    bool update();  // 更新
    void draw();    // 描画
};

#endif